Revit 2027 API
BuiltInFailures.SiteImportFailures.NoPoints Property
 No points were found in the file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoPoints { get; }
Public Shared ReadOnly Property NoPoints As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoPoints {
	FailureDefinitionId^ get ();
}
static member NoPoints : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteImportFailures Class
Autodesk.Revit.DB Namespace